In [1]:
import sqlite3

# Kết nối đến SQLite
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Tạo bảng course
cursor.execute('''
CREATE TABLE IF NOT EXISTS course (
    id INTEGER PRIMARY KEY,
    course_name TEXT NOT NULL
);
''')

# Tạo bảng student
cursor.execute('''
CREATE TABLE IF NOT EXISTS student (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    class TEXT NOT NULL,
    course_id INTEGER,
    score REAL
);
''')

# Lưu thay đổi và đóng kết nối
db.commit()
db.close()

In [2]:
# Kết nối đến SQLite
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Thêm dữ liệu vào bảng course
cursor.executemany('''
INSERT INTO course (id, course_name) VALUES (?, ?)''', [
    (12, 'Giai tich'),
    (34, 'Thong ke'),
    (26, 'Tin hoc')
])

# Thêm dữ liệu vào bảng student
cursor.executemany('''
INSERT INTO student (student_id, name, class, course_id, score) VALUES (?, ?, ?, ?, ?)''', [
    (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
    (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
    (3, 'Pham Van Nam', 'Toan Tin', None, 7.9),
    (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2),
    (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0),
    (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5),
    (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
    (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
    (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2),
    (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)
])

# Lưu thay đổi
db.commit()

In [3]:

# Hiển thị dữ liệu bảng student
cursor.execute('SELECT * FROM student')
students = cursor.fetchall()
print("\nBảng Student:",students)

# Hiển thị dữ liệu bảng course
cursor.execute('SELECT * FROM course')
courses = cursor.fetchall()
print("\nBảng Course:",courses)

Bảng Student: [(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7), (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2), (3, 'Pham Van Nam', 'Toan Tin', None, 7.9), (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2), (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0), (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5), (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2), (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8), (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2), (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)]

Bảng Course: [(12, 'Giai tich'), (26, 'Tin hoc'), (34, 'Thong ke')]

In [4]:
# Truy vấn INNER JOIN
cursor.execute('''
SELECT * FROM student JOIN course ON student.course_id = course.id
''')
inner_join_results = cursor.fetchall()
print("\nINNER JOIN Student và Course:")
for row in inner_join_results:
    print(row)

INNER JOIN Student và Course:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')

In [5]:
# Truy vấn LEFT JOIN
cursor.execute('''
SELECT * FROM student LEFT JOIN course ON student.course_id = course.id
''')
left_join_results = cursor.fetchall()
print("\nLEFT JOIN Student và Course:")
for row in left_join_results:
    print(row)

LEFT JOIN Student và Course:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)

In [6]:
# Truy vấn RIGHT JOIN 
cursor.execute('''
SELECT * FROM course LEFT JOIN student ON student.course_id = course.id
''')
right_join_results = cursor.fetchall()
print("\nRIGHT JOIN Student và Course:")
for row in right_join_results:
    print(row)

RIGHT JOIN Student và Course:
(12, 'Giai tich', 1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(26, 'Tin hoc', None, None, None, None, None)
(34, 'Thong ke', 7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(34, 'Thong ke', 2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)

In [7]:
# Truy vấn  FULL OUTER JOIN 
cursor.execute('''
SELECT * FROM student LEFT JOIN course ON student.course_id = course.id
UNION
SELECT * FROM course LEFT JOIN student ON student.course_id = course.id
''')
full_outer_join_results = cursor.fetchall()
print("\nFULL OUTER JOIN  Student và Course:")
for row in full_outer_join_results:
    print(row)

FULL OUTER JOIN  Student và Course:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)
(12, 'Giai tich', 1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(26, 'Tin hoc', None, None, None, None, None)
(34, 'Thong ke', 2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(34, 'Thong ke', 7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)

In [8]:
import sqlite3
import random

# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Lấy danh sách tất cả course_id hợp lệ
cursor.execute("SELECT id FROM course")
course_ids = [row[0] for row in cursor.fetchall()]


# Nếu có course_id hợp lệ, cập nhật các giá trị NULL
if course_ids:
    random_course_id = random.choice(course_ids)  # Chọn một ID ngẫu nhiên
    cursor.execute("""
        UPDATE student 
        SET course_id = ?
        WHERE course_id IS NULL
    """, (random_course_id,))
    db.commit()

# Đóng kết nối
db.close()

In [9]:
import sqlite3

# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Xóa các bản ghi có course_id không hợp lệ
cursor.execute("""
    DELETE FROM student 
    WHERE course_id NOT IN (SELECT id FROM course)
""")

# Lưu thay đổi
db.commit()
db.close()

In [10]:
# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()
# Hiển thị dữ liệu bảng student
cursor.execute('SELECT * FROM student')
students = cursor.fetchall()
print("\nBảng Student:",students)

# Hiển thị dữ liệu bảng course
cursor.execute('SELECT * FROM course')
courses = cursor.fetchall()
print("\nBảng Course:",courses)

Bảng Student: [(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7), (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2), (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9), (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2), (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2), (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0)]

Bảng Course: [(12, 'Giai tich'), (26, 'Tin hoc'), (34, 'Thong ke')]

In [11]:
# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Truy vấn tổng số sinh viên và điểm trung bình của từng lớp
cursor.execute("""
    SELECT class, 
           COUNT(student_id) AS total_students, 
           AVG(score) AS avg_score
    FROM student
    GROUP BY class
""")

# Lấy kết quả và hiển thị
results = cursor.fetchall()
for row in results:
    print(f"Lớp: {row[0]}, Tổng sinh viên: {row[1]}, Điểm trung bình: {row[2]:.2f}")

db.close()

Lớp: Kinh Te, Tổng sinh viên: 3, Điểm trung bình: 8.53
Lớp: May Tinh, Tổng sinh viên: 2, Điểm trung bình: 6.85
Lớp: Toan Tin, Tổng sinh viên: 1, Điểm trung bình: 7.90

In [12]:
import sqlite3

# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Truy vấn tổng số sinh viên và điểm trung bình của từng môn học
cursor.execute("""
    SELECT course.course_name, 
           COUNT(student.student_id) AS total_students, 
           COALESCE(AVG(student.score), NULL) AS avg_score
    FROM course
    LEFT JOIN student ON student.course_id = course.id
    GROUP BY course.course_name
""")

# Lấy kết quả và hiển thị
results = cursor.fetchall()
for row in results:
    avg_score = f"{row[2]:.2f}" if row[2] is not None else "N/A"
    print(f"Môn học: {row[0]}, Tổng sinh viên: {row[1]}, Điểm trung bình: {avg_score}")

db.close()

Môn học: Giai tich, Tổng sinh viên: 1, Điểm trung bình: 6.70
Môn học: Thong ke, Tổng sinh viên: 2, Điểm trung bình: 9.20
Môn học: Tin hoc, Tổng sinh viên: 3, Điểm trung bình: 7.37

In [13]:
import sqlite3

# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Hàm truy vấn và hiển thị kết quả
def fetch_courses_by_score_range(condition, label):
    query = f"""
        SELECT course.course_name, 
               COUNT(student.student_id) AS total_students, 
               AVG(student.score) AS avg_score
        FROM course
        LEFT JOIN student ON student.course_id = course.id
        GROUP BY course.course_name
        HAVING {condition};
    """
    cursor.execute(query)
    results = cursor.fetchall()
    
    print(f"\n--- {label} ---")
    for row in results:
        avg_score = f"{row[2]:.2f}" if row[2] is not None else "N/A"
        print(f"Môn học: {row[0]}, Tổng sinh viên: {row[1]}, Điểm trung bình: {avg_score}")

# Danh sách môn học theo các mức điểm trung bình
fetch_courses_by_score_range("AVG(student.score) >= 9.0", "Danh sách môn học Xuất sắc (≥ 9.0)")
fetch_courses_by_score_range("AVG(student.score) BETWEEN 6.0 AND 8.9", "Danh sách môn học Tốt (6.0 - 8.9)")
fetch_courses_by_score_range("AVG(student.score) < 6.0", "Danh sách môn học Kém (< 6.0)")

# Đóng kết nối
db.close()

--- Danh sách môn học Xuất sắc (≥ 9.0) ---
Môn học: Thong ke, Tổng sinh viên: 2, Điểm trung bình: 9.20

--- Danh sách môn học Tốt (6.0 - 8.9) ---
Môn học: Giai tich, Tổng sinh viên: 1, Điểm trung bình: 6.70
Môn học: Tin hoc, Tổng sinh viên: 3, Điểm trung bình: 7.37

--- Danh sách môn học Kém (< 6.0) ---

In [14]:
import sqlite3

# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Xếp hạng sinh viên theo điểm số chung
cursor.execute("""
    SELECT student_id, name, class, course_id, score,
           (SELECT COUNT(DISTINCT s2.score) FROM student s2 WHERE s2.score > s1.score) + 1 AS overall_rank
    FROM student s1
    ORDER BY score DESC;
""")
overall_rankings = cursor.fetchall()
print("\n--- Xếp hạng sinh viên theo điểm số chung ---")
for row in overall_rankings:
    print(row)

# Xếp hạng sinh viên theo điểm số trong từng lớp
cursor.execute("""
    SELECT student_id, name, class, course_id, score,
           (SELECT COUNT(DISTINCT s2.score) 
            FROM student s2 
            WHERE s2.class = s1.class AND s2.score > s1.score) + 1 AS class_rank
    FROM student s1
    ORDER BY class, score DESC;
""")
class_rankings = cursor.fetchall()
print("\n--- Xếp hạng sinh viên theo điểm số trong từng lớp ---")
for row in class_rankings:
    print(row)

# Xếp hạng sinh viên theo điểm số trong từng môn học
cursor.execute("""
    SELECT student.student_id, student.name, student.class, course.course_name, student.score,
           (SELECT COUNT(DISTINCT s2.score)
            FROM student s2 
            WHERE s2.course_id = student.course_id AND s2.score > student.score) + 1 AS course_rank
    FROM student 
    LEFT JOIN course ON student.course_id = course.id
    ORDER BY course_name, score DESC;
""")
course_rankings = cursor.fetchall()
print("\n--- Xếp hạng sinh viên theo điểm số trong từng môn học ---")
for row in course_rankings:
    print(row)

# Đóng kết nối
db.close()

--- Xếp hạng sinh viên theo điểm số chung ---
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 1)
(3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 2)
(9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 3)
(10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 4)
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 5)

--- Xếp hạng sinh viên theo điểm số trong từng lớp ---
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 1)
(9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 1)
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 2)
(3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 1)

--- Xếp hạng sinh viên theo điểm số trong từng môn học ---
(1, 'Nguyen Minh Hoang', 'May Tinh', 'Giai tich', 6.7, 1)
(2, 'Tran Thi Lan', 'Kinh Te', 'Thong ke', 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 'Thong ke', 9.2, 1)
(3, 'Pham Van Nam', 'Toan Tin', 'Tin hoc', 7.9, 1)
(9, 'Duong Huu Phuc', 'Kinh Te', 'Tin hoc', 7.2, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 'Tin hoc', 7.0, 3)

In [15]:
import sqlite3
import pandas as pd

# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()
# Đọc dữ liệu từ bảng student và course
students_df = pd.read_sql_query("SELECT * FROM student", db)
courses_df = pd.read_sql_query("SELECT * FROM course", db)

In [16]:
# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()
def get_top_n_students(n=3, order='DESC'):
    query = f'''
    SELECT student_id, name, class, course_id, score
    FROM student s1
    WHERE (SELECT COUNT(DISTINCT s2.score) FROM student s2 WHERE s2.score {('>' if order == 'DESC' else '<')} s1.score) < {n}
    ORDER BY score {order};
    '''
    return pd.read_sql_query(query, db)


# Lấy top 3 sinh viên có điểm cao nhất/thấp nhất
top_3_highest = get_top_n_students(3, 'DESC')
top_3_lowest = get_top_n_students(3, 'ASC')

# Đóng kết nối
db.close()

# Hiển thị kết quả
print("Top 3 sinh viên có điểm cao nhất:")
print(top_3_highest)

print("\nTop 3 sinh viên có điểm thấp nhất:")
print(top_3_lowest)

Top 3 sinh viên có điểm cao nhất:
   student_id            name     class  course_id  score
0           2    Tran Thi Lan   Kinh Te         34    9.2
1           7   Bui Tien Dung   Kinh Te         34    9.2
2           3    Pham Van Nam  Toan Tin         26    7.9
3           9  Duong Huu Phuc   Kinh Te         26    7.2

Top 3 sinh viên có điểm thấp nhất:
   student_id               name     class  course_id  score
0           1  Nguyen Minh Hoang  May Tinh         12    6.7
1          10       Cao Thi Hanh  May Tinh         26    7.0
2           9     Duong Huu Phuc   Kinh Te         26    7.2

In [23]:
# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()
# Top 3 sinh viên có điểm cao nhất/thấp nhất theo từng lớp
def get_top_n_students_by_class(n=3, order='DESC'):
    query = f'''
    SELECT student_id, name, class, course_id, score
    FROM student s1
    WHERE (
        SELECT COUNT(*) 
        FROM student s2 
        WHERE s2.class = s1.class AND s2.score {('>' if order == 'DESC' else '<')} s1.score
    ) < {n}
    ORDER BY class, score {order};
    '''
    return pd.read_sql_query(query, db)

# Lấy top 3 sinh viên có điểm cao nhất/thấp nhất theo từng lớp
top_3_by_class_highest = get_top_n_students_by_class(3, 'DESC')
top_3_by_class_lowest = get_top_n_students_by_class(3, 'ASC')

print("\nTop 3 sinh viên có điểm cao nhất theo từng lớp:")
print(top_3_by_class_highest)

print("\nTop 3 sinh viên có điểm thấp nhất theo từng lớp:")
print(top_3_by_class_lowest)

Top 3 sinh viên có điểm cao nhất theo từng lớp:
   student_id               name     class  course_id  score
0           2       Tran Thi Lan   Kinh Te         34    9.2
1           7      Bui Tien Dung   Kinh Te         34    9.2
2           9     Duong Huu Phuc   Kinh Te         26    7.2
3          10       Cao Thi Hanh  May Tinh         26    7.0
4           1  Nguyen Minh Hoang  May Tinh         12    6.7
5           3       Pham Van Nam  Toan Tin         26    7.9

Top 3 sinh viên có điểm thấp nhất theo từng lớp:
   student_id               name     class  course_id  score
0           9     Duong Huu Phuc   Kinh Te         26    7.2
1           2       Tran Thi Lan   Kinh Te         34    9.2
2           7      Bui Tien Dung   Kinh Te         34    9.2
3           1  Nguyen Minh Hoang  May Tinh         12    6.7
4          10       Cao Thi Hanh  May Tinh         26    7.0
5           3       Pham Van Nam  Toan Tin         26    7.9

In [18]:
# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()
# Top 3 sinh viên có điểm cao nhất/thấp nhất theo từng lớp
def get_top_n_students_by_class(n=3, order='DESC'):
    query = f'''
    SELECT student_id, name, class, course_id, score
    FROM student s1
    WHERE (
        SELECT COUNT(*) 
        FROM student s2 
        WHERE s2.class = s1.class AND s2.score {('>' if order == 'DESC' else '<')} s1.score
    ) < {n}
    ORDER BY class, score {order};
    '''
    return pd.read_sql_query(query, db)

# Lấy top 3 sinh viên có điểm cao nhất/thấp nhất theo từng lớp
top_3_by_class_highest = get_top_n_students_by_class(3, 'DESC')
top_3_by_class_lowest = get_top_n_students_by_class(3, 'ASC')

print("\nTop 3 sinh viên có điểm cao nhất theo từng lớp:")
print(top_3_by_class_highest)

print("\nTop 3 sinh viên có điểm thấp nhất theo từng lớp:")
print(top_3_by_class_lowest)

Top 3 sinh viên có điểm cao nhất theo từng lớp:
   student_id               name     class  course_id  score
0           2       Tran Thi Lan   Kinh Te         34    9.2
1           7      Bui Tien Dung   Kinh Te         34    9.2
2           9     Duong Huu Phuc   Kinh Te         26    7.2
3          10       Cao Thi Hanh  May Tinh         26    7.0
4           1  Nguyen Minh Hoang  May Tinh         12    6.7
5           3       Pham Van Nam  Toan Tin         26    7.9

Top 3 sinh viên có điểm thấp nhất theo từng lớp:
   student_id               name     class  course_id  score
0           9     Duong Huu Phuc   Kinh Te         26    7.2
1           2       Tran Thi Lan   Kinh Te         34    9.2
2           7      Bui Tien Dung   Kinh Te         34    9.2
3           1  Nguyen Minh Hoang  May Tinh         12    6.7
4          10       Cao Thi Hanh  May Tinh         26    7.0
5           3       Pham Van Nam  Toan Tin         26    7.9

In [19]:
# Top 3 sinh viên có điểm cao nhất/thấp nhất theo từng môn học
def get_top_n_students_by_course(n=3, order='DESC'):
    query = f'''
    SELECT student_id, name, class, course_name, score
    FROM student
    JOIN course ON student.course_id = course.id
    WHERE (
        SELECT COUNT(*) 
        FROM student s2
        WHERE s2.course_id = student.course_id AND s2.score {('>' if order == 'DESC' else '<')} student.score
    ) < {n}
    ORDER BY course_name, score {order};
    '''
    return pd.read_sql_query(query, db)
# Lấy top 3 sinh viên có điểm cao nhất/thấp nhất theo từng môn học
top_3_by_course_highest = get_top_n_students_by_course(3, 'DESC')
top_3_by_course_lowest = get_top_n_students_by_course(3, 'ASC')
print("\nTop 3 sinh viên có điểm cao nhất theo từng môn học:")
print(top_3_by_course_highest)

print("\nTop 3 sinh viên có điểm thấp nhất theo từng môn học:")
print(top_3_by_course_lowest)

Top 3 sinh viên có điểm cao nhất theo từng môn học:
   student_id               name     class course_name  score
0           1  Nguyen Minh Hoang  May Tinh   Giai tich    6.7
1           2       Tran Thi Lan   Kinh Te    Thong ke    9.2
2           7      Bui Tien Dung   Kinh Te    Thong ke    9.2
3           3       Pham Van Nam  Toan Tin     Tin hoc    7.9
4           9     Duong Huu Phuc   Kinh Te     Tin hoc    7.2
5          10       Cao Thi Hanh  May Tinh     Tin hoc    7.0

Top 3 sinh viên có điểm thấp nhất theo từng môn học:
   student_id               name     class course_name  score
0           1  Nguyen Minh Hoang  May Tinh   Giai tich    6.7
1           2       Tran Thi Lan   Kinh Te    Thong ke    9.2
2           7      Bui Tien Dung   Kinh Te    Thong ke    9.2
3          10       Cao Thi Hanh  May Tinh     Tin hoc    7.0
4           9     Duong Huu Phuc   Kinh Te     Tin hoc    7.2
5           3       Pham Van Nam  Toan Tin     Tin hoc    7.9

In [ ]:
import sqlite3
import pandas as pd
from datetime import datetime, timedelta

# Kết nối đến database
db = sqlite3.connect("school.db")
cursor = db.cursor()

# Đọc dữ liệu từ bảng student
students_df = pd.read_sql_query("SELECT student_id, name, score FROM student", db)

# Xếp hạng sinh viên theo điểm số (DENSE_RANK)
students_df["ranking"] = students_df["score"].rank(method="dense", ascending=False)


# Cập nhật graduation_date: Lấy ngày hiện tại + số tháng tương ứng với thứ hạng
current_date = datetime.now()
students_df["graduation_date"] = students_df["ranking"].apply(lambda x: (current_date + timedelta(days=int(x) * 30)).strftime("%Y-%m-%d"))

# Cập nhật lại dữ liệu vào bảng student
for index, row in students_df.iterrows():
    cursor.execute("""
        UPDATE students
        SET graduation_date = ?
        WHERE student_id = ?;
    """, (row["graduation_date"], row["student_id"]))

# Lưu thay đổi
db.commit()

# Kiểm tra kết quả
updated_df = pd.read_sql_query("SELECT student_id, name, score, graduation_date FROM student ORDER BY graduation_date", db)
db.close()

# Hiển thị kết quả
print(updated_df)

   student_id               name  score graduation_date
0           2       Tran Thi Lan    9.2      2025-04-12
1           7      Bui Tien Dung    9.2      2025-04-12
2           3       Pham Van Nam    7.9      2025-05-12
3           9     Duong Huu Phuc    7.2      2025-06-11
4          10       Cao Thi Hanh    7.0      2025-07-11
5           1  Nguyen Minh Hoang    6.7      2025-08-10